SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_msc.h
/* Bit fields for MSC STATUS */
#define _MSC_STATUS_RESETVALUE                  0x08000008UL                            /**< Default value for MSC_STATUS                */
#define _MSC_STATUS_MASK                        0xF90100FFUL                            /**< Mask for MSC_STATUS                         */
#define MSC_STATUS_BUSY                         (0x1UL << 0)                            /**< Erase/Write Busy                            */
#define _MSC_STATUS_BUSY_SHIFT                  0                                       /**< Shift value for MSC_BUSY                    */
#define _MSC_STATUS_BUSY_MASK                   0x1UL                                   /**< Bit mask for MSC_BUSY                       */
#define _MSC_STATUS_BUSY_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_BUSY_DEFAULT                 (_MSC_STATUS_BUSY_DEFAULT << 0)         /**< Shifted mode DEFAULT for MSC_STATUS         */
#define MSC_STATUS_LOCKED                       (0x1UL << 1)                            /**< Access Locked                               */
#define _MSC_STATUS_LOCKED_SHIFT                1                                       /**< Shift value for MSC_LOCKED                  */
#define _MSC_STATUS_LOCKED_MASK                 0x2UL                                   /**< Bit mask for MSC_LOCKED                     */
#define _MSC_STATUS_LOCKED_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_LOCKED_DEFAULT               (_MSC_STATUS_LOCKED_DEFAULT << 1)       /**< Shifted mode DEFAULT for MSC_STATUS         */
#define MSC_STATUS_INVADDR                      (0x1UL << 2)                            /**< Invalid Write Address or Erase Page         */
#define _MSC_STATUS_INVADDR_SHIFT               2                                       /**< Shift value for MSC_INVADDR                 */
#define _MSC_STATUS_INVADDR_MASK                0x4UL                                   /**< Bit mask for MSC_INVADDR                    */
#define _MSC_STATUS_INVADDR_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_INVADDR_DEFAULT              (_MSC_STATUS_INVADDR_DEFAULT << 2)      /**< Shifted mode DEFAULT for MSC_STATUS         */
#define MSC_STATUS_WDATAREADY                   (0x1UL << 3)                            /**< WDATA Write Ready                           */
#define _MSC_STATUS_WDATAREADY_SHIFT            3                                       /**< Shift value for MSC_WDATAREADY              */
#define _MSC_STATUS_WDATAREADY_MASK             0x8UL                                   /**< Bit mask for MSC_WDATAREADY                 */
#define _MSC_STATUS_WDATAREADY_DEFAULT          0x00000001UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_WDATAREADY_DEFAULT           (_MSC_STATUS_WDATAREADY_DEFAULT << 3)   /**< Shifted mode DEFAULT for MSC_STATUS         */
#define MSC_STATUS_ERASEABORTED                 (0x1UL << 4)                            /**< The Current Flash Erase Operation Aborte    */
#define _MSC_STATUS_ERASEABORTED_SHIFT          4                                       /**< Shift value for MSC_ERASEABORTED            */
#define _MSC_STATUS_ERASEABORTED_MASK           0x10UL                                  /**< Bit mask for MSC_ERASEABORTED               */
#define _MSC_STATUS_ERASEABORTED_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_ERASEABORTED_DEFAULT         (_MSC_STATUS_ERASEABORTED_DEFAULT << 4) /**< Shifted mode DEFAULT for MSC_STATUS         */
#define MSC_STATUS_PENDING                      (0x1UL << 5)                            /**< Write command is in queue                   */
#define _MSC_STATUS_PENDING_SHIFT               5                                       /**< Shift value for MSC_PENDING                 */
#define _MSC_STATUS_PENDING_MASK                0x20UL                                  /**< Bit mask for MSC_PENDING                    */
#define _MSC_STATUS_PENDING_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_PENDING_DEFAULT              (_MSC_STATUS_PENDING_DEFAULT << 5)      /**< Shifted mode DEFAULT for MSC_STATUS         */
#define MSC_STATUS_TIMEOUT                      (0x1UL << 6)                            /**< Write command timeout flag                  */
#define _MSC_STATUS_TIMEOUT_SHIFT               6                                       /**< Shift value for MSC_TIMEOUT                 */
#define _MSC_STATUS_TIMEOUT_MASK                0x40UL                                  /**< Bit mask for MSC_TIMEOUT                    */
#define _MSC_STATUS_TIMEOUT_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_TIMEOUT_DEFAULT              (_MSC_STATUS_TIMEOUT_DEFAULT << 6)      /**< Shifted mode DEFAULT for MSC_STATUS         */
#define MSC_STATUS_RANGEPARTIAL                 (0x1UL << 7)                            /**< EraseRange with skipped locked pages        */
#define _MSC_STATUS_RANGEPARTIAL_SHIFT          7                                       /**< Shift value for MSC_RANGEPARTIAL            */
#define _MSC_STATUS_RANGEPARTIAL_MASK           0x80UL                                  /**< Bit mask for MSC_RANGEPARTIAL               */
#define _MSC_STATUS_RANGEPARTIAL_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_RANGEPARTIAL_DEFAULT         (_MSC_STATUS_RANGEPARTIAL_DEFAULT << 7) /**< Shifted mode DEFAULT for MSC_STATUS         */
#define MSC_STATUS_REGLOCK                      (0x1UL << 16)                           /**< Register Lock Status                        */
#define _MSC_STATUS_REGLOCK_SHIFT               16                                      /**< Shift value for MSC_REGLOCK                 */
#define _MSC_STATUS_REGLOCK_MASK                0x10000UL                               /**< Bit mask for MSC_REGLOCK                    */
#define _MSC_STATUS_REGLOCK_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define _MSC_STATUS_REGLOCK_UNLOCKED            0x00000000UL                            /**< Mode UNLOCKED for MSC_STATUS                */
#define _MSC_STATUS_REGLOCK_LOCKED              0x00000001UL                            /**< Mode LOCKED for MSC_STATUS                  */
#define MSC_STATUS_REGLOCK_DEFAULT              (_MSC_STATUS_REGLOCK_DEFAULT << 16)     /**< Shifted mode DEFAULT for MSC_STATUS         */
#define MSC_STATUS_REGLOCK_UNLOCKED             (_MSC_STATUS_REGLOCK_UNLOCKED << 16)    /**< Shifted mode UNLOCKED for MSC_STATUS        */
#define MSC_STATUS_REGLOCK_LOCKED               (_MSC_STATUS_REGLOCK_LOCKED << 16)      /**< Shifted mode LOCKED for MSC_STATUS          */
#define MSC_STATUS_PWRON                        (0x1UL << 24)                           /**< Flash power on status                       */
#define _MSC_STATUS_PWRON_SHIFT                 24                                      /**< Shift value for MSC_PWRON                   */
#define _MSC_STATUS_PWRON_MASK                  0x1000000UL                             /**< Bit mask for MSC_PWRON                      */
#define _MSC_STATUS_PWRON_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_PWRON_DEFAULT                (_MSC_STATUS_PWRON_DEFAULT << 24)       /**< Shifted mode DEFAULT for MSC_STATUS         */
#define MSC_STATUS_WREADY                       (0x1UL << 27)                           /**< Flash Write Ready                           */
#define _MSC_STATUS_WREADY_SHIFT                27                                      /**< Shift value for MSC_WREADY                  */
#define _MSC_STATUS_WREADY_MASK                 0x8000000UL                             /**< Bit mask for MSC_WREADY                     */
#define _MSC_STATUS_WREADY_DEFAULT              0x00000001UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_WREADY_DEFAULT               (_MSC_STATUS_WREADY_DEFAULT << 27)      /**< Shifted mode DEFAULT for MSC_STATUS         */
#define _MSC_STATUS_PWRUPCKBDFAILCOUNT_SHIFT    28                                      /**< Shift value for MSC_PWRUPCKBDFAILCOUNT      */
#define _MSC_STATUS_PWRUPCKBDFAILCOUNT_MASK     0xF0000000UL                            /**< Bit mask for MSC_PWRUPCKBDFAILCOUNT         */
#define _MSC_STATUS_PWRUPCKBDFAILCOUNT_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS                 */
#define MSC_STATUS_PWRUPCKBDFAILCOUNT_DEFAULT   (_MSC_STATUS_PWRUPCKBDFAILCOUNT_DEFAULT << 28) /**< Shifted mode DEFAULT for MSC_STATUS         */

/* Bit fields for MSC IF */
#define _MSC_IF_RESETVALUE                      0x00000000UL                            /**< Default value for MSC_IF                    */
#define _MSC_IF_MASK                            0x00000307UL                            /**< Mask for MSC_IF                             */
#define MSC_IF_ERASE                            (0x1UL << 0)                            /**< Host Erase Done Interrupt Read Flag         */
#define _MSC_IF_ERASE_SHIFT                     0                                       /**< Shift value for MSC_ERASE                   */
#define _MSC_IF_ERASE_MASK                      0x1UL                                   /**< Bit mask for MSC_ERASE                      */
#define _MSC_IF_ERASE_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for MSC_IF                     */
#define MSC_IF_ERASE_DEFAULT                    (_MSC_IF_ERASE_DEFAULT << 0)            /**< Shifted mode DEFAULT for MSC_IF             */
#define MSC_IF_WRITE                            (0x1UL << 1)                            /**< Host Write Done Interrupt Read Flag         */
#define _MSC_IF_WRITE_SHIFT                     1                                       /**< Shift value for MSC_WRITE                   */
#define _MSC_IF_WRITE_MASK                      0x2UL                                   /**< Bit mask for MSC_WRITE                      */
#define _MSC_IF_WRITE_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for MSC_IF                     */
#define MSC_IF_WRITE_DEFAULT                    (_MSC_IF_WRITE_DEFAULT << 1)            /**< Shifted mode DEFAULT for MSC_IF             */
#define MSC_IF_WDATAOV                          (0x1UL << 2)                            /**< Host write buffer overflow                  */
#define _MSC_IF_WDATAOV_SHIFT                   2                                       /**< Shift value for MSC_WDATAOV                 */
#define _MSC_IF_WDATAOV_MASK                    0x4UL                                   /**< Bit mask for MSC_WDATAOV                    */
#define _MSC_IF_WDATAOV_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for MSC_IF                     */
#define MSC_IF_WDATAOV_DEFAULT                  (_MSC_IF_WDATAOV_DEFAULT << 2)          /**< Shifted mode DEFAULT for MSC_IF             */
#define MSC_IF_PWRUPF                           (0x1UL << 8)                            /**< Flash Power Up Sequence Complete Flag       */
#define _MSC_IF_PWRUPF_SHIFT                    8                                       /**< Shift value for MSC_PWRUPF                  */
#define _MSC_IF_PWRUPF_MASK                     0x100UL                                 /**< Bit mask for MSC_PWRUPF                     */
#define _MSC_IF_PWRUPF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for MSC_IF                     */
#define MSC_IF_PWRUPF_DEFAULT                   (_MSC_IF_PWRUPF_DEFAULT << 8)           /**< Shifted mode DEFAULT for MSC_IF             */
#define MSC_IF_PWROFF                           (0x1UL << 9)                            /**< Flash Power Off Sequence Complete Flag      */
#define _MSC_IF_PWROFF_SHIFT                    9                                       /**< Shift value for MSC_PWROFF                  */
#define _MSC_IF_PWROFF_MASK                     0x200UL                                 /**< Bit mask for MSC_PWROFF                     */
#define _MSC_IF_PWROFF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for MSC_IF                     */
#define MSC_IF_PWROFF_DEFAULT                   (_MSC_IF_PWROFF_DEFAULT << 9)           /**< Shifted mode DEFAULT for MSC_IF             */

/* Bit fields for MSC IEN */
#define _MSC_IEN_RESETVALUE                     0x00000000UL                            /**< Default value for MSC_IEN                   */
#define _MSC_IEN_MASK                           0x00000307UL                            /**< Mask for MSC_IEN                            */
#define MSC_IEN_ERASE                           (0x1UL << 0)                            /**< Erase Done Interrupt enable                 */
#define _MSC_IEN_ERASE_SHIFT                    0                                       /**< Shift value for MSC_ERASE                   */
#define _MSC_IEN_ERASE_MASK                     0x1UL                                   /**< Bit mask for MSC_ERASE                      */
#define _MSC_IEN_ERASE_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for MSC_IEN                    */
#define MSC_IEN_ERASE_DEFAULT                   (_MSC_IEN_ERASE_DEFAULT << 0)           /**< Shifted mode DEFAULT for MSC_IEN            */
#define MSC_IEN_WRITE                           (0x1UL << 1)                            /**< Write Done Interrupt enable                 */
#define _MSC_IEN_WRITE_SHIFT                    1                                       /**< Shift value for MSC_WRITE                   */
#define _MSC_IEN_WRITE_MASK                     0x2UL                                   /**< Bit mask for MSC_WRITE                      */
#define _MSC_IEN_WRITE_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for MSC_IEN                    */
#define MSC_IEN_WRITE_DEFAULT                   (_MSC_IEN_WRITE_DEFAULT << 1)           /**< Shifted mode DEFAULT for MSC_IEN            */
#define MSC_IEN_WDATAOV                         (0x1UL << 2)                            /**< write data buffer overflow irq enable       */
#define _MSC_IEN_WDATAOV_SHIFT                  2                                       /**< Shift value for MSC_WDATAOV                 */
#define _MSC_IEN_WDATAOV_MASK                   0x4UL                                   /**< Bit mask for MSC_WDATAOV                    */
#define _MSC_IEN_WDATAOV_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for MSC_IEN                    */
#define MSC_IEN_WDATAOV_DEFAULT                 (_MSC_IEN_WDATAOV_DEFAULT << 2)         /**< Shifted mode DEFAULT for MSC_IEN            */
#define MSC_IEN_PWRUPF                          (0x1UL << 8)                            /**< Flash Power Up Seq done irq enable          */
#define _MSC_IEN_PWRUPF_SHIFT                   8                                       /**< Shift value for MSC_PWRUPF                  */
#define _MSC_IEN_PWRUPF_MASK                    0x100UL                                 /**< Bit mask for MSC_PWRUPF                     */
#define _MSC_IEN_PWRUPF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for MSC_IEN                    */
#define MSC_IEN_PWRUPF_DEFAULT                  (_MSC_IEN_PWRUPF_DEFAULT << 8)          /**< Shifted mode DEFAULT for MSC_IEN            */
#define MSC_IEN_PWROFF                          (0x1UL << 9)                            /**< Flash Power Off Seq done irq enable         */
#define _MSC_IEN_PWROFF_SHIFT                   9                                       /**< Shift value for MSC_PWROFF                  */
#define _MSC_IEN_PWROFF_MASK                    0x200UL                                 /**< Bit mask for MSC_PWROFF                     */
#define _MSC_IEN_PWROFF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for MSC_IEN                    */
#define MSC_IEN_PWROFF_DEFAULT                  (_MSC_IEN_PWROFF_DEFAULT << 9)          /**< Shifted mode DEFAULT for MSC_IEN            */

/* Bit fields for MSC USERDATASIZE */
#define _MSC_USERDATASIZE_RESETVALUE            0x00000004UL                            /**< Default value for MSC_USERDATASIZE          */
#define _MSC_USERDATASIZE_MASK                  0x0000003FUL                            /**< Mask for MSC_USERDATASIZE                   */
#define _MSC_USERDATASIZE_USERDATASIZE_SHIFT    0                                       /**< Shift value for MSC_USERDATASIZE            */
#define _MSC_USERDATASIZE_USERDATASIZE_MASK     0x3FUL                                  /**< Bit mask for MSC_USERDATASIZE               */
#define _MSC_USERDATASIZE_USERDATASIZE_DEFAULT  0x00000004UL                            /**< Mode DEFAULT for MSC_USERDATASIZE           */
#define MSC_USERDATASIZE_USERDATASIZE_DEFAULT   (_MSC_USERDATASIZE_USERDATASIZE_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_USERDATASIZE   */

/* Bit fields for MSC CMD */
#define _MSC_CMD_RESETVALUE                     0x00000000UL                            /**< Default value for MSC_CMD                   */
#define _MSC_CMD_MASK                           0x00000011UL                            /**< Mask for MSC_CMD                            */
#define MSC_CMD_PWRUP                           (0x1UL << 0)                            /**< Flash Power Up Command                      */
#define _MSC_CMD_PWRUP_SHIFT                    0                                       /**< Shift value for MSC_PWRUP                   */
#define _MSC_CMD_PWRUP_MASK                     0x1UL                                   /**< Bit mask for MSC_PWRUP                      */
#define _MSC_CMD_PWRUP_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for MSC_CMD                    */
#define MSC_CMD_PWRUP_DEFAULT                   (_MSC_CMD_PWRUP_DEFAULT << 0)           /**< Shifted mode DEFAULT for MSC_CMD            */
#define MSC_CMD_PWROFF                          (0x1UL << 4)                            /**< Flash power off/sleep command               */
#define _MSC_CMD_PWROFF_SHIFT                   4                                       /**< Shift value for MSC_PWROFF                  */
#define _MSC_CMD_PWROFF_MASK                    0x10UL                                  /**< Bit mask for MSC_PWROFF                     */
#define _MSC_CMD_PWROFF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for MSC_CMD                    */
#define MSC_CMD_PWROFF_DEFAULT                  (_MSC_CMD_PWROFF_DEFAULT << 4)          /**< Shifted mode DEFAULT for MSC_CMD            */

/* Bit fields for MSC LOCK */
#define _MSC_LOCK_RESETVALUE                    0x00000000UL                            /**< Default value for MSC_LOCK                  */
#define _MSC_LOCK_MASK                          0x0000FFFFUL                            /**< Mask for MSC_LOCK                           */
#define _MSC_LOCK_LOCKKEY_SHIFT                 0                                       /**< Shift value for MSC_LOCKKEY                 */
#define _MSC_LOCK_LOCKKEY_MASK                  0xFFFFUL                                /**< Bit mask for MSC_LOCKKEY                    */
#define _MSC_LOCK_LOCKKEY_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for MSC_LOCK                   */
#define _MSC_LOCK_LOCKKEY_LOCK                  0x00000000UL                            /**< Mode LOCK for MSC_LOCK                      */
#define _MSC_LOCK_LOCKKEY_UNLOCK                0x00001B71UL                            /**< Mode UNLOCK for MSC_LOCK                    */
#define MSC_LOCK_LOCKKEY_DEFAULT                (_MSC_LOCK_LOCKKEY_DEFAULT << 0)        /**< Shifted mode DEFAULT for MSC_LOCK           */
#define MSC_LOCK_LOCKKEY_LOCK                   (_MSC_LOCK_LOCKKEY_LOCK << 0)           /**< Shifted mode LOCK for MSC_LOCK              */
#define MSC_LOCK_LOCKKEY_UNLOCK                 (_MSC_LOCK_LOCKKEY_UNLOCK << 0)         /**< Shifted mode UNLOCK for MSC_LOCK            */

/* Bit fields for MSC MISCLOCKWORD */
#define _MSC_MISCLOCKWORD_RESETVALUE            0x00000011UL                            /**< Default value for MSC_MISCLOCKWORD          */
#define _MSC_MISCLOCKWORD_MASK                  0x00000011UL                            /**< Mask for MSC_MISCLOCKWORD                   */
#define MSC_MISCLOCKWORD_MELOCKBIT              (0x1UL << 0)                            /**< Mass Erase Lock                             */
#define _MSC_MISCLOCKWORD_MELOCKBIT_SHIFT       0                                       /**< Shift value for MSC_MELOCKBIT               */
#define _MSC_MISCLOCKWORD_MELOCKBIT_MASK        0x1UL                                   /**< Bit mask for MSC_MELOCKBIT                  */
#define _MSC_MISCLOCKWORD_MELOCKBIT_DEFAULT     0x00000001UL                            /**< Mode DEFAULT for MSC_MISCLOCKWORD           */
#define MSC_MISCLOCKWORD_MELOCKBIT_DEFAULT      (_MSC_MISCLOCKWORD_MELOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_MISCLOCKWORD   */
#define MSC_MISCLOCKWORD_UDLOCKBIT              (0x1UL << 4)                            /**< User Data Lock                              */
#define _MSC_MISCLOCKWORD_UDLOCKBIT_SHIFT       4                                       /**< Shift value for MSC_UDLOCKBIT               */
#define _MSC_MISCLOCKWORD_UDLOCKBIT_MASK        0x10UL                                  /**< Bit mask for MSC_UDLOCKBIT                  */
#define _MSC_MISCLOCKWORD_UDLOCKBIT_DEFAULT     0x00000001UL                            /**< Mode DEFAULT for MSC_MISCLOCKWORD           */
#define MSC_MISCLOCKWORD_UDLOCKBIT_DEFAULT      (_MSC_MISCLOCKWORD_UDLOCKBIT_DEFAULT << 4) /**< Shifted mode DEFAULT for MSC_MISCLOCKWORD   */

