SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_msc.h
/* Bit fields for MSC PWRCTRL */
#define _MSC_PWRCTRL_RESETVALUE                 0x00100002UL                            /**< Default value for MSC_PWRCTRL               */
#define _MSC_PWRCTRL_MASK                       0x00FF0013UL                            /**< Mask for MSC_PWRCTRL                        */
#define MSC_PWRCTRL_PWROFFONEM1ENTRY            (0x1UL << 0)                            /**< Power down Flash macro when enter EM1       */
#define _MSC_PWRCTRL_PWROFFONEM1ENTRY_SHIFT     0                                       /**< Shift value for MSC_PWROFFONEM1ENTRY        */
#define _MSC_PWRCTRL_PWROFFONEM1ENTRY_MASK      0x1UL                                   /**< Bit mask for MSC_PWROFFONEM1ENTRY           */
#define _MSC_PWRCTRL_PWROFFONEM1ENTRY_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for MSC_PWRCTRL                */
#define MSC_PWRCTRL_PWROFFONEM1ENTRY_DEFAULT    (_MSC_PWRCTRL_PWROFFONEM1ENTRY_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PWRCTRL        */
#define MSC_PWRCTRL_PWROFFONEM1PENTRY           (0x1UL << 1)                            /**< Power down Flash macro when enter EM1P      */
#define _MSC_PWRCTRL_PWROFFONEM1PENTRY_SHIFT    1                                       /**< Shift value for MSC_PWROFFONEM1PENTRY       */
#define _MSC_PWRCTRL_PWROFFONEM1PENTRY_MASK     0x2UL                                   /**< Bit mask for MSC_PWROFFONEM1PENTRY          */
#define _MSC_PWRCTRL_PWROFFONEM1PENTRY_DEFAULT  0x00000001UL                            /**< Mode DEFAULT for MSC_PWRCTRL                */
#define MSC_PWRCTRL_PWROFFONEM1PENTRY_DEFAULT   (_MSC_PWRCTRL_PWROFFONEM1PENTRY_DEFAULT << 1) /**< Shifted mode DEFAULT for MSC_PWRCTRL        */
#define MSC_PWRCTRL_PWROFFENTRYAGAIN            (0x1UL << 4)                            /**< POWER down flash again in EM1/EM1p          */
#define _MSC_PWRCTRL_PWROFFENTRYAGAIN_SHIFT     4                                       /**< Shift value for MSC_PWROFFENTRYAGAIN        */
#define _MSC_PWRCTRL_PWROFFENTRYAGAIN_MASK      0x10UL                                  /**< Bit mask for MSC_PWROFFENTRYAGAIN           */
#define _MSC_PWRCTRL_PWROFFENTRYAGAIN_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for MSC_PWRCTRL                */
#define MSC_PWRCTRL_PWROFFENTRYAGAIN_DEFAULT    (_MSC_PWRCTRL_PWROFFENTRYAGAIN_DEFAULT << 4) /**< Shifted mode DEFAULT for MSC_PWRCTRL        */
#define _MSC_PWRCTRL_PWROFFDLY_SHIFT            16                                      /**< Shift value for MSC_PWROFFDLY               */
#define _MSC_PWRCTRL_PWROFFDLY_MASK             0xFF0000UL                              /**< Bit mask for MSC_PWROFFDLY                  */
#define _MSC_PWRCTRL_PWROFFDLY_DEFAULT          0x00000010UL                            /**< Mode DEFAULT for MSC_PWRCTRL                */
#define MSC_PWRCTRL_PWROFFDLY_DEFAULT           (_MSC_PWRCTRL_PWROFFDLY_DEFAULT << 16)  /**< Shifted mode DEFAULT for MSC_PWRCTRL        */

/* Bit fields for MSC PAGELOCK0 */
#define _MSC_PAGELOCK0_RESETVALUE               0x00000000UL                            /**< Default value for MSC_PAGELOCK0             */
#define _MSC_PAGELOCK0_MASK                     0xFFFFFFFFUL                            /**< Mask for MSC_PAGELOCK0                      */
#define _MSC_PAGELOCK0_LOCKBIT_SHIFT            0                                       /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCK0_LOCKBIT_MASK             0xFFFFFFFFUL                            /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCK0_LOCKBIT_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for MSC_PAGELOCK0              */
#define MSC_PAGELOCK0_LOCKBIT_DEFAULT           (_MSC_PAGELOCK0_LOCKBIT_DEFAULT << 0)   /**< Shifted mode DEFAULT for MSC_PAGELOCK0      */

/* Bit fields for MSC PAGELOCK1 */
#define _MSC_PAGELOCK1_RESETVALUE               0x00000000UL                            /**< Default value for MSC_PAGELOCK1             */
#define _MSC_PAGELOCK1_MASK                     0xFFFFFFFFUL                            /**< Mask for MSC_PAGELOCK1                      */
#define _MSC_PAGELOCK1_LOCKBIT_SHIFT            0                                       /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCK1_LOCKBIT_MASK             0xFFFFFFFFUL                            /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCK1_LOCKBIT_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for MSC_PAGELOCK1              */
#define MSC_PAGELOCK1_LOCKBIT_DEFAULT           (_MSC_PAGELOCK1_LOCKBIT_DEFAULT << 0)   /**< Shifted mode DEFAULT for MSC_PAGELOCK1      */

/** @} End of group EFR32SG23_MSC_BitFields */
/** @} End of group EFR32SG23_MSC */
/** @} End of group Parts */

#endif // EFR32SG23_MSC_H
